# Dictionary

In [1]:
import pandas as pd
# Dictionary를 이용한 DataFrame 생성
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[14,15,16]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [14, 15, 16]}

In [2]:
df = pd.DataFrame(dict_data)

In [4]:
# list를 이용한 DataFrame 생성 
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index= ['준서','예은'], #row names 
    columns=['나이','성별','학교']  # column names
    )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [7]:
# 행과 열 이름 확인 
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [8]:
# 행 인덱스 , 열 이름 변경하기 - 1 
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [9]:
# list를 이용한 DataFrame 생성 
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index= ['준서','예은'], #row names 
    columns=['나이','성별','학교']  # column names
    )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [10]:
df.rename(columns={'나이':'연령','성별':'남녀','학교':'소속'},inplace = True)
# inplace = TRUE 바로 적용
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [11]:
# 행이름 변경하기 
df.rename(index={'준서':'학생1','예은':'학생2'},inplace = True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [12]:
# 새로운 데이터 프레임 만들기 
st1 = {"수학":90,'영어':98,'음악':85,'체육':100}
st2 = {"수학":80,'영어':89,'음악':95,'체육':90}
st3 = {"수학":70,'영어':95,'음악':100,'체육':90}

In [14]:
st = [st1,st2,st3]

In [15]:
df = pd.DataFrame(st, 
index = ['서준','우현','인아'],
columns=['수학','영어','음악','체육'])

In [16]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [21]:
df2 = df.copy()

In [22]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [19]:
#df의 index가 우현인 1개행을 삭제
df2.drop('우현',axis=0,inplace=True)  
# 0번 방향

In [20]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [23]:
df3 = df.copy()

In [24]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [25]:
# df3의 index가 우현과 인아인 2개 행을 삭제 
df3.drop(['우현','인아'],axis=0,inplace=True)  
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [31]:
df4 = df.copy()

In [32]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [33]:
# 열삭제
df4.drop(['수학'], axis=1, inplace=True)
# 열방향 = 1 
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [37]:
df5 = df.copy()

In [38]:
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [41]:
# df5의 영어와 음악 2개 열을 삭제
df5.drop(['영어','음악'],axis='columns',inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90